#!/usr/bin/env python3

import numpy as np
import csv
import sys

დისკ_სიხშირე=44100
ხმა=[]
#შემდეგი არგუმენტის აღება და მისი მიხედვით სიის შექმნა
with open(sys.argv[1], 'rt')as f:
	reader = csv.reader(f, delimiter='	', skipinitialspace=True)
	ინფო=list()
	cols=next(reader)
	
	for col in cols:
		ინფო.append(list())
	for line in reader:
		for i in range(0,len(ინფო)):
			ინფო[i].append(line[i])
	ხმ_ინფო=dict()
	
	for i in range(0,len(cols)):
		ხმ_ინფო[cols[i]]=ინფო[i]

სიხშირეები=ხმ_ინფო['Frequency (Hz)']
სიძლიერეები=ხმ_ინფო['Level (dB)']
ტესტი=[299,805,1181,2406,2879,3708,4074,5026,5578,6108,7010,7388]
სიხტესტ=[-18.2,-17,-19.3,-43.8,-36.7,-49.5,-57.5,-63.7,-67,-64.2,-50.9,-54.3]

def აჯამე(სიხ,სიძ,დრო,დისკ):
	global ხმა
	ბიჯ=0 #ითვლის ბიჯებს, არცთუ გამოუსადეგარია 
	if isinstance(სიხ, list): #ვამოწმებთ არის თუ არა სია
		for x in სიხ:
			#ამპლიტუდა, მოცემული დეციბელებში, არის კვეთა, რომელიც გამოითვლება ფორმულით
			#ა/ბ=10^(დეციბელი/10).
			#ვიღებთ დამრგვალებულს რადგან,
			#არც არის საჭირო იდეალური სიზუსტე და პროგრამაც უფრო სწრაფია.
			ამპლიტუდა=10**(round(float(სიძ[ბიჯ]),1)/10)
			
			#ამას ბევრი ახსნა არ სჭირდება, დამრგვალებული ანალოგიური მიზეზით
			გრადუსი=2*np.pi*np.arange(დისკ*დრო)*round(float(x),1)/დისკ
			#მოკლედ, ხმის სიაში ვაგდებთ სინუსოიდებს გამრავლებული ამპლიტუდაზე
			ხმა.append((np.sin(გრადუსი)*ამპლიტუდა).astype(np.float32))
			ბიჯ+=1
			print(round(ბიჯ/len(სიხ)*100,1),"%")
		#ვჯამავთ სინუსოიდებს ლისტში
		ხმა=sum(ხმა)
		
	else:	#ეს არავის ანაღვლებს
		ხმა=(np.sin(2*np.pi*np.arange(სიხ*დრო)*სიხ/დისკ)).astype(np.float32)
		ხმა=np.asarray(ხმა)
	return ხმა

გენერირებული=აჯამე(ტესტი,სიხტესტ,2,დისკ_სიხშირე) #ვიძახებთ აჯამვის ფუნქციას
მდებარეობა='/home/clever/სამუშაო მაგიდა/ხმა'
np.save(მდებარეობა,გენერირებული)#ვინახავთ ფაილს


